micropython/micropython/ports/espressif/boards/wemos_lolin32_lite/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2024 Bill Sideris, independently providing these changes.
//
// SPDX-License-Identifier: MIT

#pragma once

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "WeMos LOLIN32 Lite"
#define MICROPY_HW_MCU_NAME         "ESP32"

#define MICROPY_HW_LED_STATUS       (&pin_GPIO22)
#define MICROPY_HW_LED_STATUS_INVERTED (1)

// For entering safe mode, use SW38 button
#define CIRCUITPY_BOOT_BUTTON       (&pin_GPIO0)

// UART pins attached to the USB-serial converter chip
#define CIRCUITPY_CONSOLE_UART_TX (&pin_GPIO1)
#define CIRCUITPY_CONSOLE_UART_RX (&pin_GPIO3)
